[
    {
        "title": "#Fail: the quality and accuracy of nutrition-related information by influential Australian Instagram accounts",
        "authors": [
            "E. Denniss",
            "R. Lindberg",
            "Laura E. Marchese",
            "Sarah A. McNaughton"
        ],
        "year": 2024,
        "abstract": "Background Social media is a popular source of information about food and nutrition. There is a high degree of inaccurate and poor-quality nutrition-related information present online. The aim of this study was to evaluate the quality and accuracy of nutrition-related information posted by popular Australian Instagram accounts and examine trends in quality and accuracy based on author, topic, post engagement, account verification and number of followers. Methods A sample of posts by Australian Instagram accounts with ≥ 100,000 followers who primarily posted about nutrition was collected between September 2020 and September 2021. Posts containing nutrition-related information were evaluated to determine the quality and accuracy of the information. Quality was assessed using the Principles for Health-Related Information on Social Media tool and accuracy was assessed against information contained in the Australian Dietary Guidelines, Practice-based Evidence in Nutrition database, Nutrient Reference Values and Metafact. Results A total of 676 posts were evaluated for quality and 510 posts for accuracy, originating from 47 Instagram accounts. Overall, 34.8% of posts were classified as being of poor quality, 59.2% mediocre, 6.1% good and no posts were of excellent quality. A total of 44.7% of posts contained inaccuracies. Posts authored by nutritionists or dietitians were associated with higher quality scores (β, 17.8, CI 13.94–21.65; P  < 0.001) and higher accuracy scores (OR 4.69, CI 1.81–12.14, P  = 0.001) compared to brands and other accounts. Information about supplements was of lower accuracy (OR 0.23, CI 0.10–0.51, P  < 0.001) compared to information about weight loss and other nutrition topics. Engagement tended to be higher for posts of lower quality (β -0.59, P  = 0.012), as did engagement rate (β -0.57, P  = 0.016). There was no relationship between followers or account verification and information quality or accuracy and no relationship between engagement and accuracy. Conclusions Nutrition-related information published by influential Australian Instagram accounts is often inaccurate and of suboptimal quality. Information about supplements and posts by brand accounts is of the lowest quality and accuracy and information posted by nutritionists and dietitians is of a higher standard. Instagram users are at risk of being misinformed when engaging with Australian Instagram content for information about nutrition.",
        "paper_url": "https://www.semanticscholar.org/paper/d9a1930a10e5430701c3f4fd2be7df93905c5e30",
        "pdf_path": "pdfs/instagram/paper2.pdf"
    },
    {
        "title": "Peranan Media Sosial Instagram terhadap Interaksi Sosial dan Etika pada Generasi Z",
        "authors": [
            "Kartini Sikumbang",
            "Widya Ramadhina",
            "Emi Riska Yani",
            "Della Arika",
            "Nazmi Hayati",
            "N. Hasibuan",
            "Bagus Gigih Permana"
        ],
        "year": 2024,
        "abstract": "Instagram is a popular social media platform and is used by many people, including generation Z. This platform offers various features that support users in spreading content, interacting with friends, and building social networks. In recent years, Instagram has become a very popular platform among generation Z. This platform offers various interesting features, such as short video displays (IGTV), various content formats (carousel, album, and hybrid video), and interactive features such as stories and interactions with friends (likes, comments and shares). Therefore, Instagram is an ideal place for young people to interact socially and promises interesting content. This platform allows users to display their content creatively and interact with friends, either directly directing friends through comments and likes, or through the interactive feature Instagram Stories. In this context, we will discuss how Instagram's features influence the way generation Z interacts socially, as well as how this platform has become an important tool in their daily lives. Additionally, we'll discuss how users can optimize their Instagram experience to increase social interactions and build a strong network. In the results of this research, we will discuss the use of Instagram by generation Z in various aspects, from the features used to successful marketing strategies. By understanding the role of social media Instagram in social interaction in generation Z, we can conclude that Instagram has the potential to become a very important tool in the life and rise of generation Z in the digital world.",
        "paper_url": "https://www.semanticscholar.org/paper/cdcac68b6ee837d5ea4ee697880300eb7e4e3fe2",
        "pdf_path": "pdfs/instagram/paper4.pdf"
    },
    {
        "title": "Sustainability, brand authenticity and Instagram messaging",
        "authors": [
            "Sandy Bulmer",
            "Nitha Palakshappa",
            "S. Dodds",
            "Sarah Harper"
        ],
        "year": 2024,
        "abstract": null,
        "paper_url": "https://www.semanticscholar.org/paper/3c6ce99c140457478156e7ce10965a5f41d888c2",
        "pdf_path": "pdfs/instagram/paper5.pdf"
    },
    {
        "title": "Influencers on Instagram: Antecedents and consequences of opinion leadership",
        "authors": [
            "L. Casaló",
            "C. Flavián",
            "Sergio Ibáñez-Sánchez"
        ],
        "year": 2020,
        "abstract": null,
        "paper_url": "https://www.semanticscholar.org/paper/210d3fd19e596f0a80487e3f7687df8b18c6b7fe",
        "pdf_path": "pdfs/instagram/paper6.pdf"
    }
]