[
    {
        "paperId": "96a616c0118d6da905c9b0ab179ffa0481e137be",
        "url": "https://www.semanticscholar.org/paper/96a616c0118d6da905c9b0ab179ffa0481e137be",
        "title": "Pengaruh Variasi Produk, Persepsi Kemudahan Penggunaan, dan Harga terhadap Kepuasan yang Berdampak pada Loyalitas Konsumen Disney+ Hotstar",
        "year": 2025,
        "openAccessPdf": {
            "url": "",
            "status": null,
            "license": null,
            "disclaimer": "Notice: Paper or abstract available at https://api.unpaywall.org/v2/10.53008/kalbisiana.v11i2.3021?email=<INSERT_YOUR_EMAIL> or https://doi.org/10.53008/kalbisiana.v11i2.3021, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."
        },
        "authors": [
            {
                "authorId": "2128988318",
                "name": "Muhammad Akbar"
            },
            {
                "authorId": "2365871654",
                "name": "Vina Meliana"
            }
        ],
        "abstract": "Technological advancements enable media and entertainment companies to reach customers more easily and generate more revenue. Using a quantitative method with purposive sampling technique, this study aims to determine the impact of product variety on customer satisfaction, the influence of user-perceived ease of use on customer satisfaction, the influence of price on customer satisfaction, and the impact of satisfaction on customer loyalty towards the object of SvoD Disney+ Hotstar. Multiple linear regression analysis is employed. The research findings indicate that product variety does not affect customer satisfaction; user-perceived ease of use influences satisfaction; price affects satisfaction; and customer satisfaction influences customer loyalty"
    },
    {
        "paperId": "6204c573215168e6d2b16830cc85f6f7709bf807",
        "url": "https://www.semanticscholar.org/paper/6204c573215168e6d2b16830cc85f6f7709bf807",
        "title": "Analisis Resepsi Penonton Perempuan Tentang Perilaku Gaslighting Dalam Web Series Yang Hilang Dalam Cinta Pada Disney+ Hotstar",
        "year": 2025,
        "openAccessPdf": {
            "url": "",
            "status": "CLOSED",
            "license": null,
            "disclaimer": "Notice: Paper or abstract available at https://api.unpaywall.org/v2/10.23969/linimasa.v8i1.15990?email=<INSERT_YOUR_EMAIL> or https://doi.org/10.23969/linimasa.v8i1.15990, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."
        },
        "authors": [
            {
                "authorId": "2345079470",
                "name": "Abdhi Gusti Illahi"
            },
            {
                "authorId": "101387171",
                "name": "Ahmad Zamzamy"
            }
        ],
        "abstract": "Abstract \nThe purpose of this research is to analyze the reception of female viewers towards gaslighting behavior in the web series \"Yang Hilang Dalam Cinta\" on Disney+ Hotstar. This study employs Stuart Hall's reception theory, which categorizes audiences into three groups in interpreting media messages: Dominant-Hegemonic Code, Negotiated Code, and Oppositional Code. This research uses a descriptive qualitative method by describing the research results using Stuart Hall's reception theory. In determining the informants, this research uses purposive sampling technique with the criteria of being female, currently or previously in a romantic relationship, and having watched the web series \"Yang Hilang Dalam Cinta\" on Disney+ Hotstar. From in-depth interviews with eight informants, six informants are in the dominant position, and two informants are in the negotiation position. Informants in the dominant position agree with the message of the series, concurring that gaslighting is a wrong and harmful behavior because it can make women powerless in a romantic relationship and lead to a range of negative impacts. Meanwhile, informants in the negotiation position also acknowledge that gaslighting is a harmful behavior, but they consider the educational aspect of the series. According to them, the presence of this series can provide examples of gaslighting behavior and its negative impacts so that women out there can have better awareness. \nKeyword: Gaslighting, Web Series, Women, Reception Analysis Stuart-Hall"
    },
    {
        "paperId": "d1fbca0c8cb1bb92a623677a4368041d0f36a43b",
        "url": "https://www.semanticscholar.org/paper/d1fbca0c8cb1bb92a623677a4368041d0f36a43b",
        "title": "Customers Preferences and Satisfaction Towards OTT Platforms with Reference to Netflix, Amazon Prime and Disney+Hotstar- A Comparative Study",
        "year": 2025,
        "openAccessPdf": {
            "url": "",
            "status": null,
            "license": null,
            "disclaimer": "Notice: Paper or abstract available at https://api.unpaywall.org/v2/10.52783/jisem.v10i3.6882?email=<INSERT_YOUR_EMAIL> or https://doi.org/10.52783/jisem.v10i3.6882, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."
        },
        "authors": [
            {
                "authorId": "2358259045",
                "name": "Dr. A. Sandhya"
            }
        ],
        "abstract": "Introduction: India is seeing an incredible growth for over the top (OTT) services. Main reason for this growth is that OTT’s are providing better content for all kind of age groups just a click away. \nObjectives: to analyze the comparison between top 3 platforms i.e., Netflix, Amazon prime and Disney+Hotstar and to find the consumers preference on these OTT platforms in a particular geographical region which helps in developing OTT’s with more advanced features which helps in acquiring more number of subscribers. \nMethods: This study is confined to particular geographical area i.e., in Nagole , Hyderabad. Sample size of 130 respondents is taken using convenience sampling method. Data collection is done through online survey i.e., questionnaire and Secondary data is been collected from various Research articles and papers regarding consumers preferences towards OTT’s \nResults: The results show that among 3 OTT platforms Amazon prime is preferred by majority of respondents followed by Disney+Hotstar. Important factors considered while opting any OTT platforms are Subscription cost, Content preference, Video quality, Ad-free content, offers, mobility etc. Customers with age group from 18-28 are more interested in OTT’s and their first preferred platform among these 3 is Amazon Prime. Females are more interested than men and are more interested to watch Disney+Hotstar. Employees are more interested in all 3 OTT’s. \nConclusions: It is said that the demand for OTT’s, will continue to increase gradually and they have bright future in India. Since the invention of over the top (OTT) platforms, we can only witness its growth and there is no downfall for these OTT’s. Subscribers for OTT’s are gradually increasing day by day. In today’s world consumer’s psychology is that they want everything quicker and easier. OTT’s main objective is to provide content, entertainment, knowledge and everything just a click away. This is the reason many people are switching towards OTT’s."
    },
    {
        "paperId": "5e8923296b741abf492e90a5ec0716f48a3aa759",
        "url": "https://www.semanticscholar.org/paper/5e8923296b741abf492e90a5ec0716f48a3aa759",
        "title": "Model Natural Language Processing untuk Analisis Review Disney+ Hotstar: Perbandingan Naive Bayes dan Decision Tree dengan Adaboost",
        "year": 2025,
        "openAccessPdf": {
            "url": "",
            "status": null,
            "license": null,
            "disclaimer": "Notice: Paper or abstract available at https://api.unpaywall.org/v2/10.31294/j-insan.v5i1.9273?email=<INSERT_YOUR_EMAIL> or https://doi.org/10.31294/j-insan.v5i1.9273, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."
        },
        "authors": [
            {
                "authorId": "72368179",
                "name": "Lila Dini Utami"
            },
            {
                "authorId": "2089770941",
                "name": "Lisda Widiastuti"
            },
            {
                "authorId": "113337089",
                "name": "Dini Nurlaela"
            }
        ],
        "abstract": "Perkembangan teknologi digital yang pesat telah mendorong peningkatan konsumsi layanan hiburan berbasis streaming seperti Disney+ Hotstar. Seiring bertambahnya pengguna, volume review yang diberikan juga meningkat dan menjadi sumber penting bagi perusahaan untuk mengevaluasi kualitas layanan. Namun, analisis manual terhadap review dalam jumlah besar menjadi tidak efisien dan rentan terhadap subjektivitas. Penelitian ini membangun dan membandingkan model analisis sentimen menggunakan Natural Language Processing (NLP) dengan algoritma Naive Bayes dan Decision Tree yang diperkuat dengan teknik Adaboost. Metode yang digunakan meliputi pengumpulan data review, preprocessing teks, penerapan model, serta evaluasi menggunakan akurasi dan AUC. Hasil penelitian menunjukkan bahwa penerapan Adaboost memberikan kontribusi signifikan dalam meningkatkan performa model klasifikasi. Naive Bayes mengalami peningkatan akurasi dan AUC, namun peningkatan yang lebih signifikan terjadi pada Decision Tree. Hal ini menunjukkan bahwa struktur Decision Tree yang fleksibel lebih kompatibel dengan pendekatan boosting. Sebaliknya, Naive Bayes yang berbasis pada asumsi distribusi probabilistik yang sederhana kurang optimal saat dikombinasikan dengan boosting. Dengan demikian, Decision Tree dengan Adaboost menjadi pilihan yang lebih unggul dalam meningkatkan akurasi dan efektivitas analisis sentimen review Disney+ Hotstar."
    },
    {
        "paperId": "23d6298f7861ad9ff20cb243da23f0622db97f87",
        "url": "https://www.semanticscholar.org/paper/23d6298f7861ad9ff20cb243da23f0622db97f87",
        "title": "COMPARISON OF AGREEMENTS FROM 4 PAY TV PLATFORMS SUCH AS NETFLIX, IQIYI, DISNEY HOTSTAR, AND WE TV REGARDING CONSUMER PROTECTION",
        "year": 2025,
        "openAccessPdf": {
            "url": "",
            "status": null,
            "license": null,
            "disclaimer": "Notice: Paper or abstract available at https://api.unpaywall.org/v2/10.61796/jaide.v2i5.1529?email=<INSERT_YOUR_EMAIL> or https://doi.org/10.61796/jaide.v2i5.1529, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."
        },
        "authors": [
            {
                "authorId": "2397958133",
                "name": "Lusiana Febri Lestari"
            },
            {
                "authorId": "2290220502",
                "name": "Sri Budi Purwaningsih"
            }
        ],
        "abstract": "Objective: This study aims to analyze the role of Indonesian positive law in regulating the sale of premium accounts through third parties and to assess the extent of consumer legal protection in such digital transactions. Method: The research adopts a normative juridical approach with a statutory and conceptual framework, supported by literature analysis and examination of relevant laws and regulations concerning e-commerce and consumer rights. Results: The findings reveal that current Indonesian legal provisions inadequately address the legality and consumer protection aspects of third-party premium account sales, creating a regulatory gap in the digital marketplace. The analysis indicates the need for clearer legal definitions, stronger enforcement mechanisms, and updated consumer protection frameworks to mitigate potential fraud and misuse. Novelty: This study contributes to the growing discourse on digital commerce law by highlighting the emerging legal implications of intangible digital goods transactions and proposing a structured legal perspective to enhance consumer protection in Indonesia’s rapidly evolving e-commerce environment."
    },
    {
        "paperId": "74c628c39a69de35b51f2768b47bda77ff8dd378",
        "url": "https://www.semanticscholar.org/paper/74c628c39a69de35b51f2768b47bda77ff8dd378",
        "title": "Evaluasi User Experience Pada Aplikasi Disney+ Hotstar Menggunakan Metode MeCUE Questionnaire (2.0)",
        "year": 2024,
        "openAccessPdf": {
            "url": "https://doi.org/10.33022/ijcs.v12i6.3540",
            "status": "GOLD",
            "license": "CCBYSA",
            "disclaimer": "Notice: Paper or abstract available at https://api.unpaywall.org/v2/10.33022/ijcs.v12i6.3540?email=<INSERT_YOUR_EMAIL> or https://doi.org/10.33022/ijcs.v12i6.3540, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."
        },
        "authors": [
            {
                "authorId": "2327678002",
                "name": "Allsela Meiriza"
            },
            {
                "authorId": "2327683634",
                "name": "Rizka Rahmadhani"
            },
            {
                "authorId": "2327678000",
                "name": "Putri Eka Sevtiyuni"
            },
            {
                "authorId": "2327678064",
                "name": "Nabila Rizky Oktadini"
            },
            {
                "authorId": "2327678066",
                "name": "Pacu Putra"
            }
        ],
        "abstract": "Aplikasi Disney+ Hotstar sebagai penyedia layanan penyaluran audio dan video menggunakan jaringan internet (Over-The-Top) mendapatkan penilaian yang rendah pada Google Play Store, sehingga perlu diperhatikan mutu dari pengalaman pengguna aplikasi dengan cara mengevaluasi pengalaman pengguna. Penelitian ini bertujuan agar pengalaman pengguna Disney+ Hotstar dapat dievaluasi dengan menggunakan metode MeCUE Questionnaire (2.0). Hasil metode meCUE 2.0 yang terdiri dari modul Persepsi Kualitas Instrumen Produk variabel Kebergunaan (5,43) dan Kemudahan Penggunaan (6,02). Modul Persepsi Kualitas Non-Instrumen Produk variabel Tampilan Estetika (5,74), Status (3,73), dan Komitmen (2,88).  Modul Emosi variabel Emosi Positif (5,27) dan Emosi Negatif (2,19). Modul Konsekuensi variabel Niat Menggunakan (4,17) dan Loyalitas Produk (3,76). Serta modul Global dengan nilai 3,8. Yang mana responden penelitian ini adalah masyarakat Kota Palembang. Dari hasil tersebut variabel kemudahan penggunaan memiliki nilai tertinggi dan variabel emosi negatif sebagai nilai terendah."
    },
    {
        "paperId": "d676ff5019a75a76e2f246e1fccb167473231d3e",
        "url": "https://www.semanticscholar.org/paper/d676ff5019a75a76e2f246e1fccb167473231d3e",
        "title": "The Effect of Viral Marketing and E-Service Quality on Consumer Buying Interest in Disney+ Hotstar Services",
        "year": 2024,
        "openAccessPdf": {
            "url": "https://jiss.publikasiindonesia.id/index.php/jiss/article/download/1029/1829",
            "status": "HYBRID",
            "license": "CCBYSA",
            "disclaimer": "Notice: Paper or abstract available at https://api.unpaywall.org/v2/10.59141/jiss.v5i04.1029?email=<INSERT_YOUR_EMAIL> or https://doi.org/10.59141/jiss.v5i04.1029, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."
        },
        "authors": [
            {
                "authorId": "2300893497",
                "name": "Rama Raihan Syihab"
            },
            {
                "authorId": "121216273",
                "name": "Erlita Ridanasti"
            }
        ],
        "abstract": "This research was conducted with the aim of determining the influence of Viral Marketing and E-Service Quality on Consumer Purchase Interest in the Disney+ Hotstar Indonesia service. The population in this study is residents who are users or residents who know the Disney+ Hotstar Indonesia Video on Demand service in the Yogyakarta area. This research uses a quantitative approach, with data collection techniques using questionnaires distributed online. The sampling technique used purposive sampling with a sample of 180 respondents. The data analysis used in this research is multiple linear regression analysis with the Moderated Regression Analysis (MRA) test which is processed with IBM SPSS Statistics 26.0 software. The results of this research show that Viral Marketing has a positive and significant influence on Consumer Purchase Interest. Meanwhile, E-service Quality has a positive and significant influence on Business Model Innovation. It was also found that organizational risk-taking tolerance is a factor in consumer buying interest. And the Viral Marketing and E-Service Quality variables together have a positive and significant effect on Consumer Purchase Interest."
    },
    {
        "paperId": "d9bfae92a087ae23cfa48d987bd0f040555509f0",
        "url": "https://www.semanticscholar.org/paper/d9bfae92a087ae23cfa48d987bd0f040555509f0",
        "title": "Word Embedding Feature for Improvement Machine Learning Performance in Sentiment Analysis Disney Plus Hotstar Comments",
        "year": 2024,
        "openAccessPdf": {
            "url": "",
            "status": null,
            "license": null,
            "disclaimer": "Notice: Paper or abstract available at https://api.unpaywall.org/v2/10.26555/jiteki.v10i2.28799?email=<INSERT_YOUR_EMAIL> or https://doi.org/10.26555/jiteki.v10i2.28799, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."
        },
        "authors": [
            {
                "authorId": "121324699",
                "name": "Jasmir Jasmir"
            },
            {
                "authorId": "2343414736",
                "name": "Nurhadi Nurhadi"
            },
            {
                "authorId": "2343412681",
                "name": "Eni Rohaini"
            },
            {
                "authorId": "2309073136",
                "name": "M. Pahlevi. B"
            },
            {
                "authorId": "2343410074",
                "name": "Daniel Sintong Pardamean Simanjuntak"
            }
        ],
        "abstract": "In this research we apply several machine learning methods and word embedding features to process social media data, specifically comments on the Disney Plus Hotstar application. The word embedding features used include Word2Vec, GloVe, and FastText. Our aim is to evaluate the impact of these features on the classification performance of machine learning methods such as Naive Bayes (NB), K-Nearest Neighbor (KNN), and Random Forest (RF). NB is very simple and efficient and very sensitive to feature selection. Meanwhile, KNN is known for its weaknesses such as biased k values, overly complex computations, memory limitations, and ignoring irrelevant attributes. Then RF has a weakness, namely that the evaluation value can change significantly with just a slight change in the data. Feature selection in text classification is crucial for enhancing scalability, efficiency, and accuracy. Our testing results indicate that KNN achieved the highest accuracy both before and after feature selection. The FastText feature led to the highest performance for KNN, yielding balanced accuracy, precision, recall, and F1-score values."
    },
    {
        "paperId": "5e3711525c6572cae2bb02b9aa0ad804a06a87cf",
        "url": "https://www.semanticscholar.org/paper/5e3711525c6572cae2bb02b9aa0ad804a06a87cf",
        "title": "Analisis Perbandingan User Experience (UX) Pada Aplikasi Netflix Dengan Disney+ Hotstar Menggunakan Metode User Experience Questionnaire (UEQ)",
        "year": 2024,
        "openAccessPdf": {
            "url": "",
            "status": "CLOSED",
            "license": null,
            "disclaimer": "Notice: Paper or abstract available at https://api.unpaywall.org/v2/10.54066/jptis.v2i2.1944?email=<INSERT_YOUR_EMAIL> or https://doi.org/10.54066/jptis.v2i2.1944, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."
        },
        "authors": [
            {
                "authorId": "2289592832",
                "name": "Adam Huda Nugraha"
            }
        ],
        "abstract": "During the COVID-19 pandemic, the Indonesian government implemented measures to ensure that the people remained in their homes and did not leave without cause. This leads to dissatisfaction among the community. More and more of them spend their time using technology like games, TV, and the internet. Internet technology has significantly changed daily life, particularly in terms of information access. Online video streaming, such Netflix and Disney+ Hotstar, is becoming the primary choice for consumers. The purpose of this study is to compare user experience (user satisfaction) between the Netflix and Disney+ Hotstar apps using the User Experience Questionnaire method (UEQ). Data collection is carried out using Google Forms as a medium to get user feedback through provided questions. Data analysis is done using Data Analysis Tools (DAT). The research results show that 5 out of 6 scales (Attractiveness, Clarity, Efficiency, Accuracy, and Novelty) for the Netflix application received an assessment of ‘Above average,’ while the Stimulation and Efficiency scales received a rating of ‘Good.’ On the other hand, for the Disney+ Hotstar application, 4 out of 6 scales (Attractiveness, Clarity, Efficiency, Accuracy, and Novelty) received a rating of '. \n "
    },
    {
        "paperId": "051338d5b9e70707043f008bac7439e2967a8457",
        "url": "https://www.semanticscholar.org/paper/051338d5b9e70707043f008bac7439e2967a8457",
        "title": "Pengaruh Customer Experience dan Persepsi Harga terhadap Minat Beli Ulang Aplikasi Streaming Disney+ Hotstar",
        "year": 2024,
        "openAccessPdf": {
            "url": "https://doi.org/10.33366/ref.v12i3.6231",
            "status": "GOLD",
            "license": null,
            "disclaimer": "Notice: Paper or abstract available at https://api.unpaywall.org/v2/10.33366/ref.v12i3.6231?email=<INSERT_YOUR_EMAIL> or https://doi.org/10.33366/ref.v12i3.6231, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."
        },
        "authors": [
            {
                "authorId": "2090971025",
                "name": "Novi Rahmadhani"
            },
            {
                "authorId": "94882924",
                "name": "Nuruni Ika Kusuma Wardhani"
            }
        ],
        "abstract": "The research intends  to explore as well as assess the impact of customer experience also price perception on repurchase interest for the Disney+ Hotstar streaming service. This study was conducted with 110 respondents, all of whom were Disney+ Hotstar customers living in Surabaya. The purposive sampling approach was employed, and the study was quantitative. The data will be measured and analyzed using SmartPLS. The study explains that: (1) Customer Experience has a significant impact on repurchase interest for the Disney+ Hotstar streaming service, and (2) Price Perception positively influences repurchase interest."
    }
]