[
    {
        "paperId": "be5d3154022eb410c4b0db202062b47b6de6bca2",
        "url": "https://www.semanticscholar.org/paper/be5d3154022eb410c4b0db202062b47b6de6bca2",
        "title": "Instagram and YouTube bloggers promote it, why should I buy? How credibility and parasocial interaction influence purchase intentions",
        "year": 2020,
        "openAccessPdf": {
            "url": "",
            "status": "CLOSED",
            "license": null,
            "disclaimer": "Notice: Paper or abstract available at https://api.unpaywall.org/v2/10.1016/J.JRETCONSER.2019.01.011?email=<INSERT_YOUR_EMAIL> or https://doi.org/10.1016/J.JRETCONSER.2019.01.011, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."
        },
        "authors": [
            {
                "authorId": "79176954",
                "name": "K. Sokolova"
            },
            {
                "authorId": "2862460",
                "name": "Hajer Kefi"
            }
        ],
        "abstract": null
    },
    {
        "paperId": "22ac0a0e6ab46dde2efc5b5df3768930503169ac",
        "url": "https://www.semanticscholar.org/paper/22ac0a0e6ab46dde2efc5b5df3768930503169ac",
        "title": "The effects of Facebook and Instagram on the 2020 election: A deactivation experiment",
        "year": 2024,
        "openAccessPdf": {
            "url": "https://www.pnas.org/doi/pdf/10.1073/pnas.2321584121",
            "status": "HYBRID",
            "license": "CCBYNCND",
            "disclaimer": "Notice: Paper or abstract available at https://pmc.ncbi.nlm.nih.gov/articles/PMC11126999, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."
        },
        "authors": [
            {
                "authorId": "6112526",
                "name": "Hunt Allcott"
            },
            {
                "authorId": "8731644",
                "name": "M. Gentzkow"
            },
            {
                "authorId": "2264248753",
                "name": "Winter Mason"
            },
            {
                "authorId": "119368856",
                "name": "Arjun S. Wilkins"
            },
            {
                "authorId": "2301195301",
                "name": "Pablo Barberá"
            },
            {
                "authorId": "2225053404",
                "name": "Taylor Brown"
            },
            {
                "authorId": "2301194646",
                "name": "Juan Carlos Cisneros"
            },
            {
                "authorId": "1423126179",
                "name": "Adriana Crespo-Tenorio"
            },
            {
                "authorId": "90810256",
                "name": "Drew Dimmery"
            },
            {
                "authorId": "2202119",
                "name": "Deen Freelon"
            },
            {
                "authorId": "1404609254",
                "name": "Sandra González-Bailón"
            },
            {
                "authorId": "67045794",
                "name": "A. Guess"
            },
            {
                "authorId": "2264344712",
                "name": "Y. Kim"
            },
            {
                "authorId": "2243177085",
                "name": "David Lazer"
            },
            {
                "authorId": "2264191209",
                "name": "Neil Malhotra"
            },
            {
                "authorId": "116755034",
                "name": "D. Moehler"
            },
            {
                "authorId": "2274059639",
                "name": "Sameer Nair-Desai"
            },
            {
                "authorId": "2301195121",
                "name": "Houda Nait El Barj"
            },
            {
                "authorId": "2279980297",
                "name": "Brendan Nyhan"
            },
            {
                "authorId": "2301193888",
                "name": "Ana Carolina Paixao de Queiroz"
            },
            {
                "authorId": "2256380240",
                "name": "Jennifer Pan"
            },
            {
                "authorId": "2264628562",
                "name": "Jaime Settle"
            },
            {
                "authorId": "26668235",
                "name": "Emily A. Thorson"
            },
            {
                "authorId": "40944409",
                "name": "Rebekah Tromble"
            },
            {
                "authorId": "1996335415",
                "name": "Carlos Velasco Rivera"
            },
            {
                "authorId": "2301195114",
                "name": "Benjamin Wittenbrink"
            },
            {
                "authorId": "2264636135",
                "name": "Magdalena Wojcieszak"
            },
            {
                "authorId": "2181500275",
                "name": "Saam Zahedian"
            },
            {
                "authorId": "3874846",
                "name": "Annie Franco"
            },
            {
                "authorId": "2301195112",
                "name": "Chad Kiewiet de Jonge"
            },
            {
                "authorId": "40387300",
                "name": "N. Stroud"
            },
            {
                "authorId": "1903670",
                "name": "Joshua A. Tucker"
            }
        ],
        "abstract": "Significance We provide the largest-scale evidence available to date on the effect of Facebook and Instagram access on political knowledge, attitudes, and behavior in a presidential election season. This study is part of the U.S. 2020 Facebook and Instagram Election Study, a unique collaboration between academics and researchers at Meta that allowed unprecedented access to Meta platform data and algorithms while also including extensive safeguards to guarantee the integrity of the research."
    },
    {
        "paperId": "d9a1930a10e5430701c3f4fd2be7df93905c5e30",
        "url": "https://www.semanticscholar.org/paper/d9a1930a10e5430701c3f4fd2be7df93905c5e30",
        "title": "#Fail: the quality and accuracy of nutrition-related information by influential Australian Instagram accounts",
        "year": 2024,
        "openAccessPdf": {
            "url": "https://ijbnpa.biomedcentral.com/counter/pdf/10.1186/s12966-024-01565-y",
            "status": "GOLD",
            "license": "CCBY",
            "disclaimer": "Notice: Paper or abstract available at https://pmc.ncbi.nlm.nih.gov/articles/PMC10865719, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."
        },
        "authors": [
            {
                "authorId": "1633557832",
                "name": "E. Denniss"
            },
            {
                "authorId": "2284074195",
                "name": "R. Lindberg"
            },
            {
                "authorId": "2126495187",
                "name": "Laura E. Marchese"
            },
            {
                "authorId": "2222318912",
                "name": "Sarah A. McNaughton"
            }
        ],
        "abstract": "Background Social media is a popular source of information about food and nutrition. There is a high degree of inaccurate and poor-quality nutrition-related information present online. The aim of this study was to evaluate the quality and accuracy of nutrition-related information posted by popular Australian Instagram accounts and examine trends in quality and accuracy based on author, topic, post engagement, account verification and number of followers. Methods A sample of posts by Australian Instagram accounts with ≥ 100,000 followers who primarily posted about nutrition was collected between September 2020 and September 2021. Posts containing nutrition-related information were evaluated to determine the quality and accuracy of the information. Quality was assessed using the Principles for Health-Related Information on Social Media tool and accuracy was assessed against information contained in the Australian Dietary Guidelines, Practice-based Evidence in Nutrition database, Nutrient Reference Values and Metafact. Results A total of 676 posts were evaluated for quality and 510 posts for accuracy, originating from 47 Instagram accounts. Overall, 34.8% of posts were classified as being of poor quality, 59.2% mediocre, 6.1% good and no posts were of excellent quality. A total of 44.7% of posts contained inaccuracies. Posts authored by nutritionists or dietitians were associated with higher quality scores (β, 17.8, CI 13.94–21.65; P  < 0.001) and higher accuracy scores (OR 4.69, CI 1.81–12.14, P  = 0.001) compared to brands and other accounts. Information about supplements was of lower accuracy (OR 0.23, CI 0.10–0.51, P  < 0.001) compared to information about weight loss and other nutrition topics. Engagement tended to be higher for posts of lower quality (β -0.59, P  = 0.012), as did engagement rate (β -0.57, P  = 0.016). There was no relationship between followers or account verification and information quality or accuracy and no relationship between engagement and accuracy. Conclusions Nutrition-related information published by influential Australian Instagram accounts is often inaccurate and of suboptimal quality. Information about supplements and posts by brand accounts is of the lowest quality and accuracy and information posted by nutritionists and dietitians is of a higher standard. Instagram users are at risk of being misinformed when engaging with Australian Instagram content for information about nutrition."
    },
    {
        "paperId": "67101ccc59de25b026064c4b54f81095d4f998ce",
        "url": "https://www.semanticscholar.org/paper/67101ccc59de25b026064c4b54f81095d4f998ce",
        "title": "From Posts to Practice - Instagram's Role in Veterinary Dairy Cow Nutrition Education: How Does the Audience Interact and Apply Knowledge? A Survey Study.",
        "year": 2024,
        "openAccessPdf": {
            "url": "",
            "status": null,
            "license": null,
            "disclaimer": "Notice: Paper or abstract available at https://api.unpaywall.org/v2/10.3168/jds.2024-25347?email=<INSERT_YOUR_EMAIL> or https://doi.org/10.3168/jds.2024-25347, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."
        },
        "authors": [
            {
                "authorId": "2266939995",
                "name": "M. Lamanna"
            },
            {
                "authorId": "2179186882",
                "name": "E. Muca"
            },
            {
                "authorId": "2120478217",
                "name": "G. Buonaiuto"
            },
            {
                "authorId": "2332774073",
                "name": "A. Formigoni"
            },
            {
                "authorId": "2304249478",
                "name": "D. Cavallini"
            }
        ],
        "abstract": "This study evaluates Instagram's efficacy as an educational tool in veterinary sciences, focusing on dairy cow nutrition and management. Using the Instagram account \"Stalla Didattica Unibo,\" established in December 2020, a survey was conducted with 102 respondents, primarily consisting of university students (44.12%). The respondents were divided into 2 major groups: students and the general population, with the latter comprising professionals and others not currently in educational programs. In the overall population, the age group of 25-34 accounted for 51%, but among students, it was 73.3%. In terms of gender distribution, there was a female majority in the general population (59.8%) and a male majority among students (73.3%). Most responders were from Italy, with Emilia-Romagna contributing significantly. Engagement was measured not only by the length of time participants followed the account but also by active interactions such as likes, comments, and shares. Among the total population, 47.1% had followed the page for over a year, compared with 37.8% of students. Importantly, engagement metrics showed active participation, with a majority reporting improved knowledge (75.6% of the total population and 74.5% of students) and practical application of content (64.4% of the total population and 67.6% of students). Content preferences varied, with the general population favoring quizzes (33.3%) and stories (17.8%), while students showed a stronger preference for standard posts (36.3%). Impact was defined as the perceived influence of the Instagram content on the respondents' learning and professional practices, with 46.7% of the total population and 52.9% of students agreeing or strongly agreeing that the page had a positive impact on their knowledge and practical skills. Furthermore, 84.3% of students and 77.8% of the total population stated they would recommend the page to others, underscoring the account's effectiveness as a digital educational tool. The study highlights Instagram's potential to enhance veterinary education and suggests further research to explore the broader application of these strategies across different educational contexts and platforms."
    },
    {
        "paperId": "407271afa64ad92b813b44d743f510f5af31c86d",
        "url": "https://www.semanticscholar.org/paper/407271afa64ad92b813b44d743f510f5af31c86d",
        "title": "Marketing through instagram influencers: impact of number of followers and product divergence on brand attitude",
        "year": 2016,
        "openAccessPdf": {
            "url": "",
            "status": null,
            "license": null
        },
        "authors": [
            {
                "authorId": "10734208",
                "name": "Marijke De Veirman"
            },
            {
                "authorId": "47278872",
                "name": "Veroline Cauberghe"
            },
            {
                "authorId": "8372328",
                "name": "L. Hudders"
            }
        ],
        "abstract": null
    },
    {
        "paperId": "aa12f942a8c9724428ca7ddc1410897fe4a6844e",
        "url": "https://www.semanticscholar.org/paper/aa12f942a8c9724428ca7ddc1410897fe4a6844e",
        "title": "Artificial Intelligence in Influencer Marketing: A Mixed-Method Comparison of Human and Virtual Influencers on Instagram",
        "year": 2024,
        "openAccessPdf": {
            "url": "https://www.tandfonline.com/doi/pdf/10.1080/15252019.2024.2313721?needAccess=true",
            "status": "HYBRID",
            "license": "CCBYNCND",
            "disclaimer": "Notice: Paper or abstract available at https://api.unpaywall.org/v2/10.1080/15252019.2024.2313721?email=<INSERT_YOUR_EMAIL> or https://doi.org/10.1080/15252019.2024.2313721, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."
        },
        "authors": [
            {
                "authorId": "2294953615",
                "name": "Jiemin Looi"
            },
            {
                "authorId": "2294952195",
                "name": "Lee Ann Kahlor"
            }
        ],
        "abstract": "Abstract The prominence and profitability of influencer marketing have facilitated a proliferation of virtual influencers—fictitious digital personalities created and managed using artificial intelligence. Virtual influencers may offer advertisers greater creative control and yield greater engagement than human influencers. Hence, we investigated these claims by comparing the persuasion strategies and outcomes between human and virtual influencers. We retrieved 99,680 English-language Instagram posts uploaded by 424 human and virtual influencers within the beauty, fashion, and lifestyle domains from 2020 to 2022. Dictionary-based sentiment analysis (replicated across the AFINN and Bing lexicons) indicated that Instagram posts from both types of influencers predominantly conveyed positive sentiment. Latent Dirichlet allocation topic modeling revealed that both types of influencers asserted opinion leadership differently: Human influencers engaged in active self-promotion, while virtual influencers emphasized their identity. A natural experiment found that human influencers elicited greater engagement than virtual influencers. Influencer tier also significantly interacted with Instagram verification to affect engagement. Theoretical contributions, managerial implications, and directions for future research are discussed."
    },
    {
        "paperId": "cdcac68b6ee837d5ea4ee697880300eb7e4e3fe2",
        "url": "https://www.semanticscholar.org/paper/cdcac68b6ee837d5ea4ee697880300eb7e4e3fe2",
        "title": "Peranan Media Sosial Instagram terhadap Interaksi Sosial dan Etika pada Generasi Z",
        "year": 2024,
        "openAccessPdf": {
            "url": "https://jonedu.org/index.php/joe/article/download/4888/3846",
            "status": "GOLD",
            "license": "CCBYSA",
            "disclaimer": "Notice: Paper or abstract available at https://api.unpaywall.org/v2/10.31004/joe.v6i2.4888?email=<INSERT_YOUR_EMAIL> or https://doi.org/10.31004/joe.v6i2.4888, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."
        },
        "authors": [
            {
                "authorId": "2277970398",
                "name": "Kartini Sikumbang"
            },
            {
                "authorId": "2255584676",
                "name": "Widya Ramadhina"
            },
            {
                "authorId": "2277965245",
                "name": "Emi Riska Yani"
            },
            {
                "authorId": "2277970754",
                "name": "Della Arika"
            },
            {
                "authorId": "2277967018",
                "name": "Nazmi Hayati"
            },
            {
                "authorId": "2277957207",
                "name": "N. Hasibuan"
            },
            {
                "authorId": "2260483442",
                "name": "Bagus Gigih Permana"
            }
        ],
        "abstract": "Instagram is a popular social media platform and is used by many people, including generation Z. This platform offers various features that support users in spreading content, interacting with friends, and building social networks. In recent years, Instagram has become a very popular platform among generation Z. This platform offers various interesting features, such as short video displays (IGTV), various content formats (carousel, album, and hybrid video), and interactive features such as stories and interactions with friends (likes, comments and shares). Therefore, Instagram is an ideal place for young people to interact socially and promises interesting content. This platform allows users to display their content creatively and interact with friends, either directly directing friends through comments and likes, or through the interactive feature Instagram Stories. In this context, we will discuss how Instagram's features influence the way generation Z interacts socially, as well as how this platform has become an important tool in their daily lives. Additionally, we'll discuss how users can optimize their Instagram experience to increase social interactions and build a strong network. In the results of this research, we will discuss the use of Instagram by generation Z in various aspects, from the features used to successful marketing strategies. By understanding the role of social media Instagram in social interaction in generation Z, we can conclude that Instagram has the potential to become a very important tool in the life and rise of generation Z in the digital world."
    },
    {
        "paperId": "3c6ce99c140457478156e7ce10965a5f41d888c2",
        "url": "https://www.semanticscholar.org/paper/3c6ce99c140457478156e7ce10965a5f41d888c2",
        "title": "Sustainability, brand authenticity and Instagram messaging",
        "year": 2024,
        "openAccessPdf": {
            "url": "https://doi.org/10.1016/j.jbusres.2024.114547",
            "status": "HYBRID",
            "license": "CCBY",
            "disclaimer": "Notice: Paper or abstract available at https://api.unpaywall.org/v2/10.1016/j.jbusres.2024.114547?email=<INSERT_YOUR_EMAIL> or https://doi.org/10.1016/j.jbusres.2024.114547, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."
        },
        "authors": [
            {
                "authorId": "2283381429",
                "name": "Sandy Bulmer"
            },
            {
                "authorId": "103965317",
                "name": "Nitha Palakshappa"
            },
            {
                "authorId": "47093470",
                "name": "S. Dodds"
            },
            {
                "authorId": "2283380731",
                "name": "Sarah Harper"
            }
        ],
        "abstract": null
    },
    {
        "paperId": "210d3fd19e596f0a80487e3f7687df8b18c6b7fe",
        "url": "https://www.semanticscholar.org/paper/210d3fd19e596f0a80487e3f7687df8b18c6b7fe",
        "title": "Influencers on Instagram: Antecedents and consequences of opinion leadership",
        "year": 2020,
        "openAccessPdf": {
            "url": "https://doi.org/10.1016/j.jbusres.2018.07.005",
            "status": "HYBRID",
            "license": "CCBY",
            "disclaimer": "Notice: Paper or abstract available at https://api.unpaywall.org/v2/10.1016/J.JBUSRES.2018.07.005?email=<INSERT_YOUR_EMAIL> or https://doi.org/10.1016/J.JBUSRES.2018.07.005, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."
        },
        "authors": [
            {
                "authorId": "3277583",
                "name": "L. Casaló"
            },
            {
                "authorId": "7751133",
                "name": "C. Flavián"
            },
            {
                "authorId": "1402689200",
                "name": "Sergio Ibáñez-Sánchez"
            }
        ],
        "abstract": null
    },
    {
        "paperId": "63a252a502fba252002603a0ecca878ba3dd7548",
        "url": "https://www.semanticscholar.org/paper/63a252a502fba252002603a0ecca878ba3dd7548",
        "title": "Navigating the New Era of Influencer Marketing: How to be Successful on Instagram, TikTok, & Co.",
        "year": 2020,
        "openAccessPdf": {
            "url": "https://journals.sagepub.com/doi/pdf/10.1177/0008125620958166",
            "status": "BRONZE",
            "license": null,
            "disclaimer": "Notice: Paper or abstract available at https://api.unpaywall.org/v2/10.1177/0008125620958166?email=<INSERT_YOUR_EMAIL> or https://doi.org/10.1177/0008125620958166, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."
        },
        "authors": [
            {
                "authorId": "2852308",
                "name": "M. Haenlein"
            },
            {
                "authorId": "1995436532",
                "name": "Ertan Anadol"
            },
            {
                "authorId": "2103862100",
                "name": "Tyler Farnsworth"
            },
            {
                "authorId": "1995430548",
                "name": "Harry Hugo"
            },
            {
                "authorId": "1995436523",
                "name": "Jess Hunichen"
            },
            {
                "authorId": "1995432108",
                "name": "D. Welte"
            }
        ],
        "abstract": "Influencer marketing represents a $10 billion industry in 2020 and is becoming of increasing relevance for many firms, especially those operating in a business-to-consumer environment. Few firms in the fashion, beauty, travel, food, or beverage industries are running marketing campaigns these days that do not include, at least to some share, a collaboration with popular users on platforms such as Instagram and TikTok. However, many marketing managers still have a less than adequate understanding of those platforms compared with their knowledge of more traditional media channels and often find it hard to make the right decision in this fast-moving environment. To provide some guidance in this respect, this article aims to give an introduction to the most critical platforms for influencer marketing. It then presents advice to firms who want to engage in influencer marketing as well as specific questions on identifying the right influencers to collaborate with."
    }
]